import { NewsItem } from '../types';

export const newsItems: NewsItem[] = [
    {
        id: 1,
        title: "Новая серия квадроциклов готова к запуску",
        date: "25 мая 2025",
        image: "/images/news1.jpg",
        content: "Мы завершили тестирование новой серии квадроциклов X-300...",
        summary: "Завершено тестирование новой линейки внедорожников.",
        tags: ["новинка", "производство"],
        isPinned: true
    },
    {
        id: 2,
        title: "Участие в выставке внедорожной техники",
        date: "5 мая 2025",
        image: "/images/news3.jpg",
        content: "Компания примет участие в международной выставке OffRoadTech-2025...",
        summary: "Якт примет участие в OffRoadTech-2025.",
        tags: ["выставка", "мероприятие"]
    },
    {
        id: 3,
        title: "Запах шин убило мотор",
        date: "10 июня 2025",
        image: "/images/news3.jpg",
        content: "Компания примет 0 мер чтобы это предотвратить",
        summary: "Проблема не будет решаться.",
        tags: ["примечание", "анекдот"],
        isPinned: false
    },
		{
        id: 4,
        title: "Новая серия квадроциклов готова к запуску",
        date: "25 мая 2025",
        image: "/images/news1.jpg",
        content: "Мы завершили тестирование новой серии квадроциклов X-300...",
        summary: "Завершено тестирование новой линейки внедорожников.",
        tags: ["новинка", "производство"],
        isPinned: true
    },
    {
        id: 5,
        title: "Участие в выставке внедорожной техники",
        date: "5 мая 2025",
        image: "/images/news3.jpg",
        content: "Компания примет участие в международной выставке OffRoadTech-2025...",
        summary: "Якт примет участие в OffRoadTech-2025.",
        tags: ["выставка", "мероприятие"]
    },
    {
        id: 6,
        title: "Запах шин убило мотор",
        date: "10 июня 2025",
        image: "/images/news3.jpg",
        content: "Компания примет 0 мер чтобы это предотвратить",
        summary: "Проблема не будет решаться.",
        tags: ["примечание", "анекдот"],
        isPinned: false
    }
];